# --------------------------------------------------------------------------------------------------------

# def print_3_times():
#     print("안녕하세요")
#     print("안녕하세요")
#     print("안녕하세요")

# print_3_times()

# --------------------------------------------------------------------------------------------------------

# def print_n_times(value,n):
#     for i in range(n):
#         print(value)
    
# print_n_times("안녕하세요",5)

# --------------------------------------------------------------------------------------------------------

def print_n_times(n, a, *values):
    #n번 반복
    for i in range(n):
        # values는 리스트처럼 활용
        for value in values:
            print(value)
        # 단순한 줄바꿈
        print(a)
    
# 함수를 호출합니다.
print_n_times(3,4,"안녕하세요","즐거운","파이썬 프로그래밍")

# --------------------------------------------------------------------------------------------------------

# def print_n_times(value, n=2):
#     #n번 반복
#     for i in range(n):
#         print(value)

# # 함수 호출

# print_n_times("안녕하세요")

# --------------------------------------------------------------------------------------------------------

# def print_n_times(*values, n=2):
#     #n번 반복합니다.
#     for i in range(n):
#         # value는 리스트처럼 활용합니다.
#         for value in values:
#             print(value)
#         #단순한 줄바꿈
#         print()

# #함수 호출
# print_n_times("안녕하세요","즐거운","파이썬 프로그래밍",n=3)

# --------------------------------------------------------------------------------------------------------

# def test(a, b=10, c=100):
#     print(a + b + c)

# # 1.기본형태

# test(10,20,30)

# # 2.키워드 매개변수로 모든 매개변수를 지정

# test(a=10,b=100,c=200)

# # 3.키워드 매개변수로 모든 매개변수를 마구잡이 지정

# test(c=10,a=100,b=200)

# # 4.키워드 매개변수로 일부 매개변수만 지정한 형태

# test(10, c=200)

# --------------------------------------------------------------------------------------------------------

# # input 함수 리턴값을 변수에 저장

# value = input(">")

# print(value)

# --------------------------------------------------------------------------------------------------------

# # 함수를 정의합니다.

# def return_test():
#     print("A 위치입니다.")
#     return
#     print("B 위치입니다.")

# # 함수 호출

# return_test()

# --------------------------------------------------------------------------------------------------------

# 함수를 정의

# def return_test():
#     return 100

# # 함수 호출

# value = return_test()
# print(value)

# --------------------------------------------------------------------------------------------------------

# # 함수 정의

# def return_test():
#     return

# # 함수 호출

# value = return_test
# print(value)

# --------------------------------------------------------------------------------------------------------

# # 함수 선언

# def sum_all(start, end):
#     # 변수 선언
#     output = 0
#     # 반복문을 돌려 숫자 더하기
#     for i in range(start, end + 1):
#         output += i
#     # 리턴합니다.
#     return output

# # 함수 호출
# print("0 to 100:", sum_all(0,100))
# print("0 to 1000:", sum_all(0,1000))
# print("50 to 100:", sum_all(50,100))
# print("500 to 1000:", sum_all(500,1000))

# --------------------------------------------------------------------------------------------------------

# # 함수 선언

# def sum_all(start=0, end=100, step=1):
#     #변수 선언
#     output = 0
#     # 반복문을 돌려 숫자를 더한다
#     for i in range(start, end + 1, step):
#         output += i
#     #리턴
#     return output

# # 함수 호출
# print("A.", sum_all(0,100,10))
# print("B.", sum_all(end=100))
# print("C.", sum_all(end=100, step=2))

# --------------------------------------------------------------------------------------------------------

# def 함수 이름():
#     문장

# def 함수 이름(매개변수, 매개변수, ...):
#     문장


# # input() 함수로 리턴값을 변수에 저장합니다.
# value = input(">")

# #출력합니다.
# print(value)

