#--------------------------------------------------------------------------------------------------------

# numbers = [103,52,273,32,77]

# print(min(numbers))

# print(max(numbers))

# print(sum(numbers))

#--------------------------------------------------------------------------------------------------------

# min(103,52,273)

# max(103,52,273)

# print(max(103,52,273))
# print(min(103,52,273))

#--------------------------------------------------------------------------------------------------------

# # 리스트 선언 및 뒤짚기

# list_a = [1,2,3,4,5]

# list_reversed = reversed(list_a)

# # 출력

# print("# reversed() 함수")
# print("reversed[1,2,3,4,5]:",list_reversed)
# print("list(reversed[1,2,3,4,5]:))",list(list_reversed))
# print()

# # 반복문 적용

# print("# reversed() 함수와 반복문")
# print("for i in reversed([1,2,3,4,5]):")

# for i in reversed(list_a):
#     print("-",i)

#--------------------------------------------------------------------------------------------------------

# temp = reversed([1,2,3,4,5,6])

# for i in temp:
#     print("첫 번째 반복문 : {}".format(i))

# for i in temp:
#     print("두 번쨰 반복문: {}".format(i))

#--------------------------------------------------------------------------------------------------------

# numbers = [1,2,3,4,5]

# print(numbers)
# print(numbers[::-1])

# print("안녕하세요"[::-1)

#--------------------------------------------------------------------------------------------------------

# example_list = ["요소A" , "요소B" , "요소C"]

# i = 0

# for item in example_list:
#     print("{}번째 요소는 {}입니다.".format(i,item))
#     i += 1

#--------------------------------------------------------------------------------------------------------

# exampel_list = ["요소A","요소B","요소C"]

# for i in range(len(exampel_list)):
#     print("{}번쨰 요소는 {}입니다.".format(i,exampel_list[i]))

#--------------------------------------------------------------------------------------------------------

# # 변수 선언

# example_list = ["요소A","요소B","요소C"]

# # 단순 출력

# print("# 단순 출력")
# print(example_list)
# print()

# # enumerate() 함수 적용 및 출력

# print("# enumerate() 함수 적용 출력")
# print(enumerate(example_list))
# print()

# # list() 함수로 강제변환

# print("# list() 함수로 강제 변환 출력")
# print(list(enumerate(example_list)))
# print()

# # for 반복문과 enmerate() 함수 조합

# print("#반복문과 조합하기")

# for i, value in enumerate(example_list):
#     print("{}번째 요소는 {}입니다.".format(i,value))

#--------------------------------------------------------------------------------------------------------

# # 변수 선언

# example_dictionary = {
#     "키A": "값A",
#     "키B": "값B",
#     "키C": "값C",
# }

# # 딕셔너리 item() 함수 결과 출력

# print("# 딕셔너리 item() 함수")
# print("item() : ", example_dictionary.items())
# print()

# # for 반복문과 items() 함수 조합해서 사용하기

# print("# 딕셔너리의 item() 함수")
# print("item() : ", example_dictionary.items())
# print()

# # for 반복문과 item() 함수 조합 

# print("# 딕셔너리의 item() 함수와 반복문 조합하기")

# for key, element in example_dictionary.items():
#     print("dictionary[{}]".format(key,element))

#--------------------------------------------------------------------------------------------------------

# 변수 선언

array = []

# 반복문 적용

for i in range(0,20,2):
    array.append(i * i)

# 출력

print(array)

#--------------------------------------------------------------------------------------------------------

# # 리스트를 선언

# array = [i * i for i in range(0,20,2)]

# # 출력합니다.

# print(array)

#--------------------------------------------------------------------------------------------------------

# #리스트를 선언

# array = ["사과","자두","초콜릿","바나나","체리"]
# output = [fruit for fruit in array if fruit != "초콜릿"]

# print(output)

#--------------------------------------------------------------------------------------------------------

# # 변수 선언

# number = int(input("정수 입력> "))

# # if로 홀수 짝수 구분

# if number % 2 == 0:
#     print("""\
#         입력한 문자열은 {}입니다.
#         {}는(은) 짝수입니다.""".format(number,number))

# else:
#     print("""\
#         입력할 문자열은 {}입니다.)
#         {}는(은) 홀수입니다. """.format(number,number))

#--------------------------------------------------------------------------------------------------------

# # 변수 선언

# number = int(input("정수 입력> "))

# # if 조건문으로 홀,짝 구분

# if number %2==0:
#     print("""입력한 문자열은 {}입니다.
# {}는(은) 짝수입니다.""".format(number, number))
    
# else:
#      print("""입력한 문자열은 {}입니다.
# {}는(은) 홀수입니다.""".format(number, number))

#--------------------------------------------------------------------------------------------------------

# # 변수 선언

# number = int(input("정수 입력> "))

# # if 조건문으로 홀,짝 구분

# if number % 2 ==0:
#     print("입력한 문자열은 {}입니다.\n{}는(은) 짝수입니다.".format(number,number))

# else:
#     print("입력한 문자열은 {}입니다.\n{}는(은) 홀수입니다.".format(number,number))

#--------------------------------------------------------------------------------------------------------

# # 변수 선언

# test = (
#     "이렇게 입력해도"
#     "하나의 문자열로 연결되어"
#     "생성됩니다."
# )

# # 출력

# print("test : ", test)
# print("type(test) : ", type(test))

#--------------------------------------------------------------------------------------------------------

# # 변수 선언

# numbers = [1,2,3,4,5,6]

# r_num = reversed(numbers)

# # reverse_numvers 출력

# print("reversed_numbers : ", r_num)
# print(next(r_num))
# print(next(r_num))
# print(next(r_num))
# print(next(r_num))
# print(next(r_num))
# print(next(r_num))

#--------------------------------------------------------------------------------------------------------

