#--------------------------------------------------------------------------------------------------------

# {
#     "키A": 10,
#     "키B": 20,
#     "키C": 30,
#     1:     40,
#     False: 50
# }

#--------------------------------------------------------------------------------------------------------

# dict_a = {
#     "name": "어벤저스 엔드게임",
#     "type": "히어로 무비"
# }

# dict_a
# {'name': '어벤저스 엔드게임' , 'type': '히어로 무비'}
# dict_a["name"]
# '어벤저스 엔드게임'
# dict_a["type"]
# '히어로 무비'

#--------------------------------------------------------------------------------------------------------

# dict_b = {
#     "director": ["안소니 루소", "조 루소"],
#     "cast": ["아이언맨", "타노스", "토르", "닥터스트레인지", "헐크"]
# }

# print(dict_b)

#--------------------------------------------------------------------------------------------------------

# # 딕셔너리를 선언합니다.

# dictionary = {
#     "name": "7D 건조 망고",
#     "type": "당절임",
#     "ingredient": ["망고", "설탕", "메타중아황산나트륨", "치자황색소"],
#     "origin": "필리핀"
# }

# # 출력합니다.

# print("name : ", dictionary["name"])
# print("type : ", dictionary["type"])
# print("ingredient : ", dictionary["ingredient"])
# print("origin : ", dictionary["origin"])
# print()

# # 값을 변경합니다.

# dictionary["name"] = "8D 건조 망고"
# print("name : ", dictionary["name"])

# print(dictionary["ingredient"])

# print(dictionary["ingredient"][1])


# dictionary["price"] = 5000

# print(dictionary)

#--------------------------------------------------------------------------------------------------------

# dict_key = {
#     name: "7D 건조 망고",
#     type: "당절임",
# }

#--------------------------------------------------------------------------------------------------------

# name = "이름"

# dict_key = {
#     name: "7D 건조 망고",
#     type: "당절임"
# }

# print(dict_key)

#--------------------------------------------------------------------------------------------------------

# # 딕셔너리를 선언합니다.

# dictionary = {}

# # 요소 추가 전에 내용을 출력해 봅니다.

# print("요소 추가 이전 : " , dictionary)

# # 딕셔너리에 요소를 추가합니다.

# dictionary["name"] = "새로운 이름"
# dictionary["head"] = "새로운 정신"
# dictionary["body"] = "새로운 몸"

# # 출력합니다

# print("요소 추가 이후 : ",dictionary)

#--------------------------------------------------------------------------------------------------------

# # 딕셔너리를 선언합니다.

# dictionary = {
#     "name": "7D 건조 망고",
#     "type": "당절임"
# }

# # 요소 제거 전에 내용을 출력해 봅니다.

# print("요소 제거 이전 : ", dictionary)

# # 딕셔너리의 요소를 제거합니다.

# del dictionary["name"]
# del dictionary["type"]

# # 요소 제거 후에 내용을 출력해 봅니다.

# print("요소 제거 이후 : ", dictionary)

#--------------------------------------------------------------------------------------------------------

# dictionary = {}

# dictionary["key"]

# # KeyError 예외

#--------------------------------------------------------------------------------------------------------

# # 딕셔너리를 선언합니다.

# dictionary = {
#     "name": "7D 건조 망고",
#     "type": "당절임",
#     "ingredient": ["망고","설탕","메타중아황산나트륨","치자황색소"],
#     "origin": "필리핀"
# }

# # 사용자로부터 입력을 받습니다.

# key = input(">접근하고자 하는 키 : ")

# # 출력합니다.

# if key in dictionary:
#     print(dictionary[key])

# else:
#     print("존재하지 않는 키에 접근하고 있습니다.")

#--------------------------------------------------------------------------------------------------------

# # 딕셔너리를 선언합니다.

# dictionary = {
#      "name": "7D 건조 망고",
#      "type": "당절임",
#      "ingredient": ["망고","설탕"," 메타중아황산나트륨","치자황색소"],
#      "origin": "필리핀"
#  }

#  # 존재하지 않는 키에 접근해 봅니다.

# value = dictionary.get("존재하지 않는 키")
# print("값", value)

#  # None 확인 방법

# if value == None:
#     print("존재하지 않는 키에 접근했었습니다.")

#--------------------------------------------------------------------------------------------------------

# # 딕셔너리를 선언합니다.

# dictionary = {
#     "name": "7D 건조 망고",
#     "type": "당절임",
#     "ingredient": ["망고","설탕","메타중아황산나트륨","치자황색소"],
#     "origin": "필리핀"
# }

# # For 반복문을 사용합니다.

# for key in dictionary:
    
#     #출력합니다.

#     print(key, ":", dictionary[key])