print("\"안녕하\t세요\"")

print('안녕하세요')

print("안녕하세요\n안녕하세요")

print("안녕하세요\t안녕하세요")

print("이름\t나이\t지역")
print("윤인성\t25\t강서구")
print("윤아린\t24\t강서구")
print("구름\t3\t강서구")

print("\\ \\ \\ \\")

print("동해물과 백두산이 마르고 닳도록\n하느님이 보우하사 우리나라 만세\n무궁화 삼천리 화려강산 대한사람\n대한으로 길이 보전하세")

print("""동해물과 백두산이 마르고 닳도록
하느님이 보우하사 우리나라 만세
무궁화 삼천리 화려강산 대한사람
대한으로 길이 보전하세""")

print("""\
    동해물과 백두산이 마르고 닳도록
    하느님이 보우하사 우리나라 만세
    무궁화 삼천리 화려강산 대한사람
    대한으로 길이 보전하세\
        """)

print("문자를 뒤에서부터 선택해 볼까요?")
print("안녕하세요"[-1])
print("안녕하세요"[-2])
print("안녕하세요"[-3])
print("안녕하세요"[-4])
print("안녕하세요"[-5])

print("안녕하세요"[1:4])

print("안녕하세요"[0:2])
print("안녕하세요"[2:4])
print("안녕하세요"[4:5])

print("안녕하세요"[1:])
print("안녕하세요"[:3])

hello = "안녕하세요"
print(hello[0:2])

print(hello)

print(len("안녕하세요"))


